In [1]:
#when to use and what it does: inplace
import pandas as pd
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.shape

(18241, 5)

In [2]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [3]:
#lets drop city for the moment
ufo.drop('City', axis = 1).head()

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
#is city column gone actually? check head again
ufo.head()
#the above code wont affect
#to make it affect, just type inplace = True
#inplace by default is false

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [9]:
#will drop a row that has any value missing 
ufo.dropna(how = 'any').shape

(2490, 4)

In [ ]:
#that means will have only 2490 rows left after dropping no values

In [10]:
ufo.shape

(18241, 4)

In [ ]:
#since we didnt use inplace true, our rows are stil there

In [ ]:
#functions we have
#ufo.rename()
#ufo.sort_values()
#ufo.set_index()
#but insteaad of inplace true, we can use assignment variable

In [11]:
ufo = ufo.set_index('Time')#this will create a second copy
#whereas ufo.set_index('Time'), inplace = True will not create a second copy to save memory if the file was huge

In [ ]:
#to fill na values
ufo.fillna(methods = 'ffill').tail()#basically these ffill is mostly used in time series data